gillwei/Keyring_nRF52832/main.c
        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        }break;//PM_EVT_STORAGE_FULL

        case PM_EVT_ERROR_UNEXPECTED:
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
            break;//PM_EVT_ERROR_UNEXPECTED

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
            break;//PM_EVT_PEER_DATA_UPDATE_SUCCEEDED

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
            // Assert.
            APP_ERROR_CHECK_BOOL(false);
            break;//PM_EVT_PEER_DATA_UPDATE_FAILED

        case PM_EVT_PEER_DELETE_SUCCEEDED:
            break;//PM_EVT_PEER_DELETE_SUCCEEDED

        case PM_EVT_PEER_DELETE_FAILED:
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
            break;//PM_EVT_PEER_DELETE_FAILED

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
						advertising_init();
            advertising_start();
            break;//PM_EVT_PEERS_DELETE_SUCCEEDED

        case PM_EVT_PEERS_DELETE_FAILED:
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
            break;//PM_EVT_PEERS_DELETE_FAILED

        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
            break;//PM_EVT_LOCAL_DB_CACHE_APPLIED

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
            break;//PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED

        case PM_EVT_SERVICE_CHANGED_IND_SENT:
            break;//PM_EVT_SERVICE_CHANGED_IND_SENT

        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
            break;//PM_EVT_SERVICE_CHANGED_IND_SENT

        default:
            // No implementation needed.
            break;
    }
}


#ifdef NRF51
/**@brief Function for handling the ADC driver eevent.
 *
 * @details  This function will fetch the conversion result from the ADC, convert the value into
 *           percentage and send it to peer.
 */
//void adc_event_handler(nrf_drv_adc_evt_t const * p_event)
//{
//    if (p_event->type == NRF_DRV_ADC_EVT_DONE)
//    {
//        nrf_adc_value_t adc_result;
//        uint16_t        batt_lvl_in_milli_volts;
//        uint8_t         percentage_batt_lvl;
//        uint32_t        err_code;

//        adc_result = p_event->data.done.p_buffer[0];

//        err_code = nrf_drv_adc_buffer_convert(p_event->data.done.p_buffer, 1);
//        APP_ERROR_CHECK(err_code);

//        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result) +
//                                  DIODE_FWD_VOLT_DROP_MILLIVOLTS;
//        percentage_batt_lvl = battery_level_in_percent(batt_lvl_in_milli_volts);

//        err_code = ble_bas_battery_level_update(&m_bas, percentage_batt_lvl);
//        if (
//            (err_code != NRF_SUCCESS)
//            &&
//            (err_code != NRF_ERROR_INVALID_STATE)
//            &&
//            (err_code != BLE_ERROR_NO_TX_PACKETS)
//            &&
//            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//           )
//        {
//            APP_ERROR_HANDLER(err_code);
//        }
//    }
//}


#else // NRF52
/**@brief Function for handling the ADC interrupt.
 *
 * @details  This function will fetch the conversion result from the ADC, convert the value into
 *           percentage and send it to peer.
 */
void saadc_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        nrf_saadc_value_t adc_result;
        uint16_t          batt_lvl_in_milli_volts;
        uint8_t           percentage_batt_lvl;
        uint32_t          err_code;

        adc_result = p_event->data.done.p_buffer[0];

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, 1);
        APP_ERROR_CHECK(err_code);

        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result) +
                                  DIODE_FWD_VOLT_DROP_MILLIVOLTS;
        percentage_batt_lvl = battery_level_in_percent(batt_lvl_in_milli_volts);
			
				batt_mV = batt_lvl_in_milli_volts;//Tsungta
				//percentage_batt_lvl = 50;//Tsungta, only for testing
			
//        err_code = ble_bas_battery_level_update(&m_bas, percentage_batt_lvl);
//        if (
//            (err_code != NRF_SUCCESS)
//            &&
//            (err_code != NRF_ERROR_INVALID_STATE)
//            &&
//            (err_code != BLE_ERROR_NO_TX_PACKETS)
//            &&
//            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
//           )
//        {
//            APP_ERROR_HANDLER(err_code);
//        }
		
		app_timer_stop(m_battery_timer_id);		
		measure_VDD_stop();
    }
}


#endif // NRF51


/**@brief Function for handling database discovery events.
 *
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_ias_c_on_db_disc_evt(&m_ias_c, p_evt);
}

bool first_init = true;

/**@brief Function for configuring ADC to do battery level conversion.
 */
void adc_configure(void)//Tsungta
{
    #ifdef NRF51
    ret_code_t err_code = nrf_drv_adc_init(NULL, adc_event_handler);
    APP_ERROR_CHECK(err_code);

    static nrf_drv_adc_channel_t channel = NRF_DRV_ADC_DEFAULT_CHANNEL(NRF_ADC_CONFIG_INPUT_DISABLED);
    //channel.config.config.input = NRF_ADC_CONFIG_SCALING_SUPPLY_ONE_THIRD;
    channel.config.config.input = (uint32_t)NRF_ADC_CONFIG_SCALING_SUPPLY_ONE_THIRD;
    nrf_drv_adc_channel_enable(&channel);

    err_code = nrf_drv_adc_buffer_convert(&adc_buf[0], 1);
    APP_ERROR_CHECK(err_code);
    #else //  NRF52
		ret_code_t err_code = nrf_drv_saadc_init(NULL, saadc_event_handler);
    APP_ERROR_CHECK(err_code);
//if (first_init) {
    nrf_saadc_channel_config_t config = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
    err_code = nrf_drv_saadc_channel_init(0,&config);
    APP_ERROR_CHECK(err_code);
		first_init = false;
		NRF_LOG_PRINTF("FIRST!!");
//}
    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[0], 1);
    APP_ERROR_CHECK(err_code);

