gillwei/Keyring_nRF52832/main.c
    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[1], 1);
    APP_ERROR_CHECK(err_code);
    #endif //NRF51
}


/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    #ifdef NRF51
    nrf_drv_adc_sample();
    #else // NRF52
    uint32_t err_code;
    err_code = nrf_drv_saadc_sample();
    APP_ERROR_CHECK(err_code);
    #endif // NRF51
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    uint32_t err_code;

    // Initialize timer module.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create battery timer.
    err_code = app_timer_create(&m_battery_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                battery_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_GENERIC_KEYRING);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_tx_power_set(TX_POWER_LEVEL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);

    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    uint32_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_FAST:
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
            APP_ERROR_CHECK(err_code);
            break;//BLE_ADV_EVT_FAST

        case BLE_ADV_EVT_IDLE:
            sleep_mode_enter();
            break;//BLE_ADV_EVT_IDLE

        default:
            break;
    }
}

static uint8_t encrypted_address_byte(uint8_t address_byte, uint8_t randnum_4bit)
{
	main_debug_8 = randnum_4bit;
	uint8_t bit_AA = randnum_4bit & 0x0C;
	uint8_t bit_BB = randnum_4bit & 0x03;
	main_debug_8 = bit_BB;
	uint8_t encry_result;
	uint8_t rotate_scale = bit_BB*2; // Maximum rotate_scale is 6
	// encrybit set for bit sort
	uint8_t encrybit_7 = (address_byte & 0x80)>> 7;
	uint8_t encrybit_6 = (address_byte & 0x40)>> 5;
	uint8_t encrybit_5 = (address_byte & 0x20)>> 3;
	uint8_t encrybit_4 = (address_byte & 0x10)>> 1;
	uint8_t encrybit_3 = (address_byte & 0x08)<< 1;
	uint8_t encrybit_2 = (address_byte & 0x04)<< 3;
	uint8_t encrybit_1 = (address_byte & 0x02)<< 5;
	uint8_t encrybit_0 = (address_byte & 0x01)<< 7;

	switch(bit_AA)
	{
		case 0x00:  // Right shift
			if (rotate_scale == 0)
				return address_byte;
			else
			{
				//  >> shift operation add 0, so we need to use OR operation 
				encry_result = (address_byte >> rotate_scale)|(address_byte << (8-rotate_scale));
				main_debug_8 = encry_result;
			}
			break;
		case 0x04:  // Bit Sort
			encry_result = encrybit_7 | encrybit_6| encrybit_5| encrybit_4| encrybit_3| encrybit_2| encrybit_1| encrybit_0;
			main_debug_8 = encry_result;
			break;
		case 0x08:  // Bit Inverse
			encry_result = ~address_byte;
			main_debug_8 = encry_result;
			break;
		case 0x0C:  // Left Shift
			if (rotate_scale == 0)
				return address_byte;
			else
			{
				encry_result = (address_byte << rotate_scale)|(address_byte >> (8-rotate_scale));
				main_debug_8 = encry_result;
			}
			break;
		default:
			break;
	}
	return encry_result;
}

uint32_t keyring_scrdata_encode(ble_advdata_t const * const p_advdata,
                         uint8_t             * const p_encoded_data,
                         uint16_t            *  const p_len)
{
	uint32_t err_code = NRF_SUCCESS;
  uint16_t max_size = *p_len;
  *p_len = 0;
  uint16_t length = 0;
	//uint16_t tx_power_level = TX_POWER_LEVEL;
	int8_t tx_power_level = TX_POWER_LEVEL;
	main_debug_16 = tx_power_level;
	// CD-SK1
	//0x43 0x44 0x2d 0x53 0x4b 0x31
	*p_len += uint16_inverse_encode(0x08FF, &p_encoded_data[*p_len]);  // Length(including AD Type) + AD type(manufacturer)
	*p_len += uint8_encode(tx_power_level, &p_encoded_data[*p_len]); 
	*p_len += uint16_inverse_encode(0x4344, &p_encoded_data[*p_len]); 
	*p_len += uint16_inverse_encode(0x2D53, &p_encoded_data[*p_len]);  
	*p_len += uint16_inverse_encode(0x4B31, &p_encoded_data[*p_len]);  	
	// tx power
	 
	return NRF_SUCCESS;
}

// Called from ble_advdata_set() in ble_advdata.c, replace adv_data_encode()
uint32_t keyring_advdata_encode(ble_advdata_t const * const p_advdata,
                         uint8_t             * const p_encoded_data,
                         uint16_t            *  const p_len)
{
	uint32_t err_code = NRF_SUCCESS;
  uint16_t max_size = *p_len;
  *p_len = 0;
  uint16_t length = 0;
	// If only encode few packets will advertise empty packet, don't know why
	//*p_len += uint8_encode(0x01, &p_encoded_data[*p_len]); 
	
	uint8_t oneTimePass[4];  // One time password generated from Car device
	main_debug = ble_ecys_random_number_get(&m_ecys,oneTimePass);
	uint8_t encry_size_1 = (uint8_t) ((oneTimePass[3] & 0xF0) >> 4);  // One time password ****
	uint8_t encry_size_2 = (uint8_t) ((oneTimePass[3] & 0x0F) >> 0);  // One time password ####
	//main_debug_8 = encry_size_2;
	uint16_t oneTimePass_u16_1 = uint16_big_decode(oneTimePass);
	uint16_t oneTimePass_u16_2 = uint16_big_decode(oneTimePass+2);
	ble_gap_addr_t ble_address;
	err_code = sd_ble_gap_address_get(&ble_address);
	//main_debug = err_code;
	memset(p_encoded_data,0,19);
	
	// Start encode advertising packet
	*p_len += uint16_inverse_encode(0x12FF, &p_encoded_data[*p_len]);     // Packet Length & AD type
	*p_len += uint16_inverse_encode(0x5001, &p_encoded_data[*p_len]);    // Company Identify Name
	*p_len += uint8_encode(0x00, &p_encoded_data[*p_len]);  // FSENS Trigger, not used
	*p_len += uint16_inverse_encode(oneTimePass_u16_1, &p_encoded_data[*p_len]); // One Time Password 1
	*p_len += uint16_inverse_encode(oneTimePass_u16_2, &p_encoded_data[*p_len]);
	// BD_address_encrypt
	uint8_t oneTimePass_4bit[6] = {0}; // Random number 4 bits  
	oneTimePass_4bit[0] = ((oneTimePass[0] & 0xF0) >> 4 );
	oneTimePass_4bit[1] = ((oneTimePass[0] & 0x0F) >> 0 );
	oneTimePass_4bit[2] = ((oneTimePass[1] & 0xF0) >> 4 );
	oneTimePass_4bit[3] = ((oneTimePass[1] & 0x0F) >> 0 );
	oneTimePass_4bit[4] = ((oneTimePass[2] & 0xF0) >> 4 );
	oneTimePass_4bit[5] = ((oneTimePass[2] & 0x0F) >> 0 );

	//1 byte encryption test
//	uint8_t byte_1 = encrypted_address_byte(ble_address.addr[3],randnum_4bit[0]);
//	main_debug_8 = byte_1;
	
	//uint8_t encrypted_addr[6] = {0};
//	for (uint8_t i = 0;i<6;i++)
//	{
//		org_data_bits.u8_bytes[i] = encrypted_address_byte(ble_address.addr[5-i],randnum_4bit[i]);		
//	}
	// Rearrange the BD encrypted data for uint16_t 
	org_data_bits.u8_bytes[1] = encrypted_address_byte(ble_address.addr[5],oneTimePass_4bit[0]);
	org_data_bits.u8_bytes[0] = encrypted_address_byte(ble_address.addr[4],oneTimePass_4bit[1]);
	org_data_bits.u8_bytes[3] = encrypted_address_byte(ble_address.addr[3],oneTimePass_4bit[2]);
	org_data_bits.u8_bytes[2] = encrypted_address_byte(ble_address.addr[2],oneTimePass_4bit[3]);
	org_data_bits.u8_bytes[5] = encrypted_address_byte(ble_address.addr[1],oneTimePass_4bit[4]);
	org_data_bits.u8_bytes[4] = encrypted_address_byte(ble_address.addr[0],oneTimePass_4bit[5]);
	
	uint16_t encry_size_u16_1 = (uint16_t) encry_size_1;
	uint16_t encry_size_u16_2 = (uint16_t) encry_size_2;
	encry_size_u16_1 = (encry_size_u16_1 << 8) |  encry_size_u16_1 ;
	encry_size_u16_2 = (encry_size_u16_2 << 8) |  encry_size_u16_2 ;
	uint16_t Keyring_randnum_1 = Keyring_gen_randnum_1 & encry_size_u16_1;
	uint16_t Keyring_randnum_2 = Keyring_gen_randnum_2 & encry_size_u16_2;
	
	// Start Encryption uint16_t : 1
	// org_data_bits.u16_bytes shift left and right number X will clear X digit in left 
	// If use shift left and right in the same line, param will have wrong value, so use temp_16 for buffer 
	uint16_t temp_16 = org_data_bits.u16_bytes[0] >>(16-encry_size_1);
	en_data_bits.u16_bytes[0] = (temp_16 << (16-encry_size_1)) | (Keyring_randnum_1 >> encry_size_1);
	// uint16_t:2
	temp_16 = org_data_bits.u16_bytes[0]  << encry_size_1;
	en_data_bits.u16_bytes[1] = (Keyring_randnum_1 << (16-encry_size_1)) | (temp_16 >> encry_size_1);
	// uint16_t:3 
	en_data_bits.u16_bytes[2] = org_data_bits.u16_bytes[1];
	// uint16_t:4
	temp_16 = org_data_bits.u16_bytes[2]  >> encry_size_2;
	en_data_bits.u16_bytes[3] = (temp_16 << encry_size_2) | (Keyring_randnum_2 >> (16-encry_size_2));
	// uint16_t:5
	temp_16 = org_data_bits.u16_bytes[2] << (16-encry_size_2);
	en_data_bits.u16_bytes[4] = (Keyring_randnum_2 << encry_size_2) | (temp_16 >> (16-encry_size_2));
	
	*p_len += uint16_inverse_encode(en_data_bits.u16_bytes[0], &p_encoded_data[*p_len]);
	*p_len += uint16_inverse_encode(en_data_bits.u16_bytes[1], &p_encoded_data[*p_len]);
	*p_len += uint16_inverse_encode(en_data_bits.u16_bytes[2], &p_encoded_data[*p_len]);
	*p_len += uint16_inverse_encode(en_data_bits.u16_bytes[3], &p_encoded_data[*p_len]);
	*p_len += uint16_inverse_encode(en_data_bits.u16_bytes[4], &p_encoded_data[*p_len]);
 
	return NRF_SUCCESS;
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    uint32_t      err_code;
    ble_advdata_t advdata;

